// laba11.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <laba1.h>

using namespace std;
class Point
{
public:
    int x, y;
};

int main()
{
   
    Point* mass;
    int n;
    cout << "Input the nuber of points : ";
    cin >> n;
    mass = new Point[n];
    for (int i = 0; i < n; i++)
    {
        cout << "x " << (i + 1) << " :";
        cin >> mass[i].x;
        cout << "y " << (i + 1) << " :";
        cin >> mass[i].y;
    }
    cout << "The smallest distance is " << closest(mass, n) << endl;
    system("pause");
    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
